{
  "format_version": "1.1",
  "char2idx": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "ा": 4,
    "्": 5,
    "र": 6,
    "ी": 7,
    "स": 8,
    "ि": 9,
    "न": 10,
    "क": 11,
    "े": 12,
    "म": 13,
    "ल": 14,
    "ं": 15,
    "प": 16,
    "व": 17,
    "य": 18,
    "त": 19,
    "ो": 20,
    "ु": 21,
    "ए": 22,
    "ट": 23,
    "द": 24,
    "ग": 25,
    "ज": 26,
    "ब": 27,
    "च": 28,
    "ड": 29,
    "ह": 30,
    "श": 31,
    "ू": 32,
    "ध": 33,
    "आ": 34,
    "फ": 35,
    "ष": 36,
    "ण": 37,
    "ई": 38,
    "भ": 39,
    "अ": 40,
    "ै": 41,
    "इ": 42,
    "ख": 43,
    "थ": 44,
    "़": 45,
    "ओ": 46,
    "ॉ": 47,
    "उ": 48,
    "ठ": 49,
    "ृ": 50,
    "ौ": 51,
    "घ": 52,
    "छ": 53,
    "झ": 54,
    "ँ": 55,
    "ढ": 56,
    "ञ": 57,
    "ऊ": 58,
    "ः": 59,
    "औ": 60,
    "ळ": 61,
    "ऑ": 62,
    "ऐ": 63,
    "ऋ": 64,
    "ऱ": 65,
    "ॅ": 66,
    "ऩ": 67,
    "ङ": 68
  },
  "idx2char": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "ा",
    "5": "्",
    "6": "र",
    "7": "ी",
    "8": "स",
    "9": "ि",
    "10": "न",
    "11": "क",
    "12": "े",
    "13": "म",
    "14": "ल",
    "15": "ं",
    "16": "प",
    "17": "व",
    "18": "य",
    "19": "त",
    "20": "ो",
    "21": "ु",
    "22": "ए",
    "23": "ट",
    "24": "द",
    "25": "ग",
    "26": "ज",
    "27": "ब",
    "28": "च",
    "29": "ड",
    "30": "ह",
    "31": "श",
    "32": "ू",
    "33": "ध",
    "34": "आ",
    "35": "फ",
    "36": "ष",
    "37": "ण",
    "38": "ई",
    "39": "भ",
    "40": "अ",
    "41": "ै",
    "42": "इ",
    "43": "ख",
    "44": "थ",
    "45": "़",
    "46": "ओ",
    "47": "ॉ",
    "48": "उ",
    "49": "ठ",
    "50": "ृ",
    "51": "ौ",
    "52": "घ",
    "53": "छ",
    "54": "झ",
    "55": "ँ",
    "56": "ढ",
    "57": "ञ",
    "58": "ऊ",
    "59": "ः",
    "60": "औ",
    "61": "ळ",
    "62": "ऑ",
    "63": "ऐ",
    "64": "ऋ",
    "65": "ऱ",
    "66": "ॅ",
    "67": "ऩ",
    "68": "ङ"
  },
  "size": 69,
  "char_freq": {
    "स": 37656,
    "ी": 39647,
    "ट": 16144,
    "ए": 16209,
    "क": 34345,
    "्": 66671,
    "ल": 28474,
    "न": 34796,
    "प": 25845,
    "ु": 16970,
    "र": 62856,
    "द": 15150,
    "ृ": 1656,
    "ग": 14749,
    "त": 24867,
    "े": 29984,
    "ह": 11543,
    "ि": 37132,
    "ं": 26503,
    "य": 25126,
    "ा": 75653,
    "ो": 21841,
    "श": 11112,
    "व": 25365,
    "थ": 3747,
    "उ": 2045,
    "म": 28475,
    "ै": 4564,
    "ब": 14256,
    "च": 12360,
    "ज": 14516,
    "ओ": 2520,
    "फ": 6238,
    "ॉ": 2097,
    "ड": 11595,
    "़": 3492,
    "ई": 4949,
    "ू": 8118,
    "इ": 4517,
    "घ": 1527,
    "ण": 5011,
    "ष": 5406,
    "ध": 7033,
    "ठ": 1887,
    "ँ": 832,
    "अ": 4908,
    "ौ": 1612,
    "भ": 4919,
    "ख": 3863,
    "आ": 6516,
    "ञ": 424,
    "झ": 843,
    "छ": 1000,
    "ऐ": 92,
    "औ": 164,
    "ढ": 596,
    "ऊ": 238,
    "ः": 190,
    "ऑ": 97,
    "ळ": 132,
    "ऋ": 49,
    "ऱ": 42,
    "ऩ": 4,
    "ॅ": 11,
    "ङ": 2
  },
  "special_tokens": {
    "pad": "<PAD>",
    "sos": "<SOS>",
    "eos": "<EOS>",
    "unk": "<UNK>"
  },
  "metadata": {
    "min_freq": 2,
    "max_vocab_size": null,
    "num_texts_built": 100000
  }
}